{
  "name": "Thai Rice Soup With Pork-Cilantro Meatballs",
  "source": "https://cooking.nytimes.com/recipes/1016651-thai-rice-soup-with-pork-cilantro-meatballs",
  "notes": [
    "Unique, healthy, very good, comfort food",
    "Go light on the chicken broth, it's a prominent flavor in the final result and can readily get too salty/strong",
    "Meatballs take longer than 2-3 minutes to cook properly, I put them in for the last 20-30 minute segment."
  ],
  "rating": 8,
  "tags": ["stew"],
  "ingredients": [
    {
      "ingredient": "garlic, peeled",
      "quantity": "2 cloves"
    },
    {
      "ingredient": "finely chopped cilantro roots or stems",
      "quantity": "2 tbsp"
    },
    {
      "ingredient": "white peppercorns",
      "quantity": "0.5 tsp"
    },
    {
      "ingredient": "ground pork",
      "quantity": "1lb"
    },
    {
      "ingredient": "oyster sauce",
      "quantity": "1 tbsp"
    },
    {
      "ingredient": "teaspoon soy sauce",
      "quantity": "1"
    },
    {
      "ingredient": "jasmine or long-grain rice",
      "quantity": "1c"
    },
    {
      "ingredient": "*light* chicken stock",
      "quantity": "6c"
    },
    {
      "ingredient": "eggs, optional",
      "quantity": "6 to 8"
    },
    {
      "ingredient": "Red chile powder (preferably Thai, but ancho or Aleppo will do)",
      "quantity": ""
    },
    {
      "ingredient": "fresh ginger, peeled and cut into matchsticks",
      "quantity": "2 inch"
    },
    {
      "ingredient": "scallions, white and green parts, finely chopped",
      "quantity": "2"
    },
    {
      "ingredient": "loosely packed fresh cilantro leaves",
      "quantity": "0.25c"
    },
    {
      "ingredient": "Fish sauce and sriracha, for garnish",
      "quantity": ""
    }
  ],
  "steps": [
    "Pound or grind the garlic, cilantro and white pepper together into a coarse paste. Transfer to a bowl and add the pork, oyster sauce and soy sauce. Mix well, cover and refrigerate at least 1 hour or overnight.",
    "In a large heavy pot, combine the rice and stock and bring to a gentle boil, then reduce to a simmer. Simmer, uncovered, for 30 minutes, stirring occasionally and scraping up any starch from the bottom to prevent scorching. Add 2 cups hot water and simmer 30 minutes more. Add another 2 cups hot water and simmer 20 to 30 minutes more, until the rice begins to fall apart in the soup.",
    "From the refrigerator, remove the dumpling mixture and the eggs, if using. Heat your serving bowls. Adjust the heat under the soup so that it bubbles gently. Pinch off pieces of the meat mixture to make bite-size balls, dropping them one at a time into the soup. When all of the meatballs have firmed up and turned opaque, about 2 to 3 minutes after adding the last one, the soup is ready.",
    "To serve, scoop a ladleful of soup into a bowl. Crack one egg, if using, into the bowl. Gently ladle more hot soup over the raw egg, covering it completely. After about 4 minutes, the eggs will be softly cooked. Dust each bowl with chile powder and sprinkle with ginger, scallions and cilantro. Serve immediately, passing fish sauce and sriracha at the table. Each diner breaks the egg yolk and scoops up the egg with the soup. Note: Use a very light-bodied chicken stock. If using prepared or canned broth or bouillon cubes, dilute with water until the salt and chicken flavors are very mild."
  ]
}
