{
  "name": "Classic Pumpkin Scones",
  "tags": ["dessert"],
  "rating": 6,
  "source": "https://sallysbakingaddiction.com/pumpkin-scones",
  "notes": [
    "Not super 'pumpkin-y', somewhat dry, the glaze isn't very flavorful. Not a bad scone at all, but not life-changing"
  ],
  "ingredients": [
    {
      "ingredient": "all-purpose flour",
      "quantity": "2c"
    },
    {
      "ingredient": "baking powder",
      "quantity": "2.5 tsp"
    },
    {
      "ingredient": "cinnamon",
      "quantity": "1 tsp"
    },
    {
      "ingredient": "pumpkin pie spice",
      "quantity": "0.5 tbsp"
    },
    {
      "ingredient": "salt",
      "quantity": "0.5 tsp"
    },
    {
      "ingredient": "unsalted butter, frozen",
      "quantity": "0.5c"
    },
    {
      "ingredient": "heavy cream, divided",
      "quantity": "0.33c + 2 tbsp"
    },
    {
      "ingredient": "egg",
      "quantity": "1"
    },
    {
      "ingredient": "pumpkin puree",
      "quantity": "0.5c"
    },
    {
      "ingredient": "light brown sugar",
      "quantity": "0.5c"
    },
    {
      "ingredient": "vanilla extract",
      "quantity": "1 tsp"
    },
    {
      "ingredient": "*Glaze:*"
    },
    {
      "ingredient": "unsalted butter",
      "quantity": "2 tbsp"
    },
    {
      "ingredient": "maple syrup",
      "quantity": "0.33c"
    },
    {
      "ingredient": "confectioner's sugar",
      "quantity": "1c"
    },
    {
      "ingredient": "salt",
      "quantity": "pinch"
    }
  ],
  "steps": [
    "Preheat oven to 400°F (204°C). Adjust baking rack to the middle-low position. Line 1 or 2 large baking sheets with parchment paper or silicone baking mat(s). If making mini scones, I use 2 baking sheets. Set aside.",
    "Make the scones: Whisk the flour, baking powder, cinnamon, pumpkin pie spice, and salt together in a large bowl. Grate the frozen butter (I use a box grater). Add the grated butter to the flour mixture and combine it with a pastry cutter, a fork, or your fingers until the mixture comes together in pea-sized crumbs. Set aside.",
    "Whisk 1/3 cup (75ml) heavy cream, the egg, blotted pumpkin (see note), brown sugar, and vanilla extract together in a small bowl. Drizzle it over the flour mixture and then mix it all together until everything appears moistened.",
    "With floured hands, work the dough into a ball as best you can and transfer onto a floured work surface. Press into a neat 8-inch disc and, with a very sharp knife, cut into 8 equal wedges. To make smaller scones, press dough into two 5-inch discs and cut each into 8 equal wedges. (Larger scones are pictured in this blog post.)",
    "Place scones at least 2 inches apart on the prepared baking sheet(s). Using a pastry brush, brush scones with remaining heavy cream and sprinkle with coarse sugar, if desired. (Gives a nice crunch!)",
    "Bake the larger scones for 20-25 minutes or until lightly browned. If you made 16 smaller scones, bake for 18-20 minutes or until lightly browned. Remove from the oven and allow to cool for a few minutes as you prepare the icing.",
    "Make the glaze: In a small saucepan over low heat, melt the butter and maple syrup together, whisking occasionally. Once the butter has melted, remove from heat and whisk in the sifted confectioners’ sugar. Taste and add a pinch of salt if desired. Drizzle over warm scones.",
    "Scones are best enjoyed right away, though leftover scones keep well at room temperature or in the refrigerator for 2 extra days."
  ]
}
